In [3]:
## Wyświetlenie danych wejściowych

In [4]:
import pandas as pd

df = pd.read_csv("athlete_events.csv")
df

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271111,135569,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,1976,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN
271112,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN
271113,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN
271114,135571,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN
271115,135571,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN

In [5]:
# Zadanie 1
years = sorted(set(df['Year']))
result_dict = {year: 0 for year in years}

for index, row in df.iterrows():
    result_dict[row['Year']] += 1

result_1 = pd.DataFrame({"Year": result_dict.keys(), "number_of_athlete": result_dict.values()})
result_1

    Year  number_of_athlete
0   1896                380
1   1900               1936
2   1904               1301
3   1906               1733
4   1908               3101
5   1912               4040
6   1920               4292
7   1924               5693
8   1928               5574
9   1932               3321
10  1936               7401
11  1948               7480
12  1952               9358
13  1956               6434
14  1960               9235
15  1964               9480
16  1968              10479
17  1972              11959
18  1976              10502
19  1980               8937
20  1984              11588
21  1988              14676
22  1992              16413
23  1994               3160
24  1996              13780
25  1998               3605
26  2000              13821
27  2002               4109
28  2004              13443
29  2006               4382
30  2008              13602
31  2010               4402
32  2012              12920
33  2014               4891
34  2016              13688

In [6]:
# Zadanie 2

# {kraj: [suma_mezczyzn: int, suma_kobiet: int, lata_w_ktorych_wystawili_zawodnikow: set]}
sum_of_people = {team: [0, 0, set()] for team in set(df['Team'])}
for index, row in df.iterrows():
    if row['Sex'] == 'M':
        sum_of_people[row['Team']][0] += 1
    else:
        sum_of_people[row['Team']][1] += 1
    sum_of_people[row['Team']][2].add(row['Year'])

_average_male = [sum_of_people[key][0] / len(sum_of_people[key][2]) for key in sum_of_people]
_average_female = [sum_of_people[key][1] / len(sum_of_people[key][2]) for key in sum_of_people]

result_2 = pd.DataFrame(
    {"Team": sum_of_people.keys(), "Average_male": _average_male, "Average_female": _average_female})
result_2

                                         Team  Average_male  Average_female
0                        United States/France           2.0            0.00
1                 Socit Nautique de Bayonne-2           8.0            0.00
2                         Favorite Hammonia-3          11.0            0.00
3     Philadelphia Turngemeinde, Philadelphia           6.0            0.00
4                                    Kon-Tiki           2.0            0.00
...                                       ...           ...             ...
1179                               Yeoman XII           3.0            0.00
1180                                     Skum           2.0            0.00
1181                                 Buraddoo           3.0            0.00
1182                              Puerto Rico          37.8            8.35
1183                                  Dinah V           3.0            0.00

[1184 rows x 3 columns]

In [11]:
# Zadanie 3 TODO
# {kraj: [liczba_różnych_zawodników, zbiór_zawodników, zbiór_olimpiad]}
different_players = {team: [0, set(), set()] for team in set(df['Team'])}
for index, row in df.iterrows():
    if row['Name'] not in different_players[row['Team']][1]:
        different_players[row['Team']][0] += 1
        different_players[row['Team']][1].add(row['Name'])
    different_players[row['Team']][2].add(row['Games'])

top_5_different_team = sorted(different_players, key=different_players.get, reverse=True)[:5]

result_3 = pd.DataFrame({"Team": top_5_different_team, "numer of player / number of olympics": [
    different_players[country][0] / len(different_players[country][2]) for country in top_5_different_team]})
result_3  # TODO check if diffrent player and len is proper

            Team  numer of player / number of olympics
0  United States                            182.280000
1         France                            113.274510
2  Great Britain                            112.901961
3          Italy                             91.921569
4        Germany                            134.382353